comunidadunab/app/views/alumnos/index.html.erb

SELECT "cursos"."id" FROM "cursos" INNER JOIN "alumno_cursos" ON "cursos"."id" = "alumno_cursos"."curso_id" WHERE "alumno_cursos"."alumno_id" = ?  [["alumno_id", 1]]
---
        <td><%= alumno.tipo %></td>
        <td><%= alumno.cursos.ids %></td>