comunidadunab/app/controllers/alumno_cursos_controller.rb

SELECT "alumno_cursos".* FROM "alumno_cursos"
---
  def index
    @alumno_cursos = AlumnoCurso.all

INSERT INTO "alumno_cursos" ("alumno_id", "curso_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["alumno_id", 2], ["curso_id", 2], ["created_at", "2019-11-20 01:39:45.585361"], ["updated_at", "2019-11-20 01:39:45.585361"]]
---
  def create
    @alumno_curso = AlumnoCurso.new(alumno_curso_params)

    respond_to do |format|
      if @alumno_curso.save

DELETE FROM "alumno_cursos" WHERE "alumno_cursos"."id" = ?  [["id", 1]]
---
  def destroy
    @alumno_curso.destroy

SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "alumno_cursos".* FROM "alumno_cursos" WHERE "alumno_cursos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_alumno_curso
      @alumno_curso = AlumnoCurso.find(params[:id])