comunidadunab/app/controllers/alumnos_controller.rb

  def index
    @alumnos = Alumno.all
---
SELECT "alumnos".* FROM "alumnos"

  def create
    @alumno = Alumno.new(alumno_params)

    respond_to do |format|
      if @alumno.save
---
INSERT INTO "alumnos" ("id", "nombre", "apellido", "email", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["id", 1], ["nombre", "nicolas"], ["apellido", "lavanderos"], ["email", "asa@hotmail.com"], ["tipo", 0], ["created_at", "2019-11-19 01:48:32.476731"], ["updated_at", "2019-11-19 01:48:32.476731"]]

  def update
    respond_to do |format|
      if @alumno.update(alumno_params)
---
UPDATE "alumnos" SET "nombre" = ?, "apellido" = ?, "email" = ?, "updated_at" = ? WHERE "alumnos"."id" = ?  [["nombre", "Nicolas"], ["apellido", "Lavanderos"], ["email", "nicolas@hotmail.com"], ["updated_at", "2019-11-20 02:02:55.107210"], ["id", 1]]

  def destroy
    @alumno.destroy
---
DELETE FROM "alumnos" WHERE "alumnos"."id" = ?  [["id", 1]]

    def set_alumno
      @alumno = Alumno.find(params[:id])
---
SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]