comunidadunab/app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all

INSERT INTO "cursos" ("id", "nombre", "periodo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", 1], ["nombre", "Algoritmos"], ["periodo", 1], ["created_at", "2019-11-19 03:02:04.649737"], ["updated_at", "2019-11-19 03:02:04.649737"]]
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save

UPDATE "cursos" SET "nombre" = ?, "updated_at" = ? WHERE "cursos"."id" = ?  [["nombre", "Arquitectura"], ["updated_at", "2019-11-20 02:07:20.139872"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @curso.update(curso_params)

DELETE FROM "cursos" WHERE "cursos"."id" = ?  [["id", 1]]
---
  def destroy
    @curso.destroy

SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_curso
      @curso = Curso.find(params[:id])