comunidadunab/app/controllers/curso_seccions_controller.rb

SELECT "curso_seccions".* FROM "curso_seccions"
---
  def index
    @curso_seccions = CursoSeccion.all

INSERT INTO "curso_seccions" ("curso_id", "seccion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["curso_id", 1], ["seccion_id", 1], ["created_at", "2019-11-20 06:15:40.990131"], ["updated_at", "2019-11-20 06:15:40.990131"]]
---
  def create
    @curso_seccion = CursoSeccion.new(curso_seccion_params)

    respond_to do |format|
      if @curso_seccion.save

DELETE FROM "curso_seccions" WHERE "curso_seccions"."id" = ?  [["id", 1]]
---
  def destroy
    @curso_seccion.destroy

SELECT "seccions".* FROM "seccions" WHERE "seccions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "curso_seccions".* FROM "curso_seccions" WHERE "curso_seccions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_curso_seccion
      @curso_seccion = CursoSeccion.find(params[:id])