comunidadunab/app/controllers/foros_controller.rb

  def index
    @foros = Foro.all
---
SELECT "foros".* FROM "foros"

  def create
    @foro = Foro.new(foro_params)

    respond_to do |format|
      if @foro.save
---
INSERT INTO "foros" ("id", "anuncio", "foro", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", 11], ["anuncio", "no ahi clase"], ["foro", "Mat201"], ["created_at", "2019-11-19 01:46:28.729121"], ["updated_at", "2019-11-19 01:46:28.729121"]]

  def destroy
    @foro.destroy
---
DELETE FROM "foros" WHERE "foros"."id" = ?  [["id", 11]]

    def set_foro
      @foro = Foro.find(params[:id])
---
SELECT "foros".* FROM "foros" WHERE "foros"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]