comunidadunab/app/controllers/mensajes_controller.rb

SELECT "mensajes".* FROM "mensajes"
---
  def index
    @mensajes = Mensaje.all

INSERT INTO "mensajes" ("id", "mensaje", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 12], ["mensaje", "hola"], ["created_at", "2019-11-19 01:44:29.338995"], ["updated_at", "2019-11-19 01:44:29.338995"]]
---
  def create
    @mensaje = Mensaje.new(mensaje_params)

    respond_to do |format|
      if @mensaje.save

UPDATE "mensajes" SET "mensaje" = ?, "updated_at" = ? WHERE "mensajes"."id" = ?  [["mensaje", "Que piensan del curso"], ["updated_at", "2019-11-19 01:45:28.461278"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @mensaje.update(mensaje_params)

DELETE FROM "mensajes" WHERE "mensajes"."id" = ?  [["id", 12]]
---
  def destroy
    @mensaje.destroy

SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def set_mensaje
      @mensaje = Mensaje.find(params[:id])