comunidadunab/app/controllers/profesors_controller.rb

  def index
    @profesors = Profesor.all
---
SELECT "profesors".* FROM "profesors"

  def create
    @profesor = Profesor.new(profesor_params)

    respond_to do |format|
      if @profesor.save
---
INSERT INTO "profesors" ("id", "nombre", "apellido", "email", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["id", 1], ["nombre", "marcela"], ["apellido", "Arias"], ["email", "marcela@hotmail.com"], ["tipo", 1], ["created_at", "2019-11-19 01:50:28.254049"], ["updated_at", "2019-11-19 01:50:28.254049"]]

  def destroy
    @profesor.destroy
---
DELETE FROM "profesors" WHERE "profesors"."id" = ?  [["id", 1]]

    def set_profesor
      @profesor = Profesor.find(params[:id])
---
SELECT "profesors".* FROM "profesors" WHERE "profesors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]