comunidadunab/app/controllers/profesor_seccions_controller.rb

SELECT "profesor_seccions".* FROM "profesor_seccions"
---
  def index
    @profesor_seccions = ProfesorSeccion.all

INSERT INTO "profesor_seccions" ("profesor_id", "seccion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["profesor_id", 1], ["seccion_id", 1], ["created_at", "2019-11-20 06:13:34.242081"], ["updated_at", "2019-11-20 06:13:34.242081"]]
---
  def create
    @profesor_seccion = ProfesorSeccion.new(profesor_seccion_params)

    respond_to do |format|
      if @profesor_seccion.save

SELECT "seccions".* FROM "seccions" WHERE "seccions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "profesor_seccions".* FROM "profesor_seccions" WHERE "profesor_seccions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_profesor_seccion
      @profesor_seccion = ProfesorSeccion.find(params[:id])