comunidadunab/app/controllers/seccions_controller.rb

SELECT "seccions".* FROM "seccions"
---
  def index
    @seccions = Seccion.all

INSERT INTO "seccions" ("id", "seccion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 1], ["seccion", 1], ["created_at", "2019-11-19 04:17:36.121163"], ["updated_at", "2019-11-19 04:17:36.121163"]]
---
  def create
    @seccion = Seccion.new(seccion_params)

    respond_to do |format|
      if @seccion.save

UPDATE "seccions" SET "seccion" = ?, "updated_at" = ? WHERE "seccions"."id" = ?  [["seccion", 101], ["updated_at", "2019-11-20 06:36:18.895064"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @seccion.update(seccion_params)

DELETE FROM "seccions" WHERE "seccions"."id" = ?  [["id", 3]]
---
  def destroy
    @seccion.destroy

SELECT "seccions".* FROM "seccions" WHERE "seccions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_seccion
      @seccion = Seccion.find(params[:id])