comunidadunab/app/controllers/usuario_cursos_controller.rb

  def index
    @usuario_cursos = UsuarioCurso.all
---
SELECT "usuario_cursos".* FROM "usuario_cursos"